---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType
source: html/28ff315c-f39c-2641-138e-06c4580c218a.htm
---
# StructuralConnectionHandlerType Methods

Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler by adding representors of input elements or subelements.